#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.random_password.master_password[0]: Refreshing state... [id=none]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=JfrGkQ]
module.us-east-1.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02b488661d2294e56]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=grafana-rds-dev-20220903030502339000000001]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_partition.current: Reading...
module.us-east-1.module.platform.data.aws_route53_zone.ktech_public: Reading...
module.us-east-1.aws_key_pair.terraform-aws: Refreshing state... [id=terraform-aws-dev]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.codedeploy_role: Refreshing state... [id=ansible_codedeploy_role-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.codepipeline_role: Refreshing state... [id=codepipeline_ansible_role-dev]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev]
module.us-east-1.module.platform.module.ansible_server.aws_kms_key.ansible_bucket_key: Refreshing state... [id=436fdfff-cde2-497a-a76e-07136fca0d4c]
module.us-east-1.module.platform.module.ansible_server.data.aws_caller_identity.current: Reading...
module.us-east-1.data.aws_ami.amazon_linux_2: Reading...
module.us-east-1.data.aws_ami.ubuntu2004: Reading...
module.us-east-1.module.platform.module.ansible_server.data.aws_caller_identity.current: Read complete after 1s [id=023093918714]
module.us-east-1.module.platform.module.ansible_server.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::023093918714:oidc-provider/token.actions.githubusercontent.com]
module.us-east-1.data.aws_availability_zones.az_zones: Reading...
module.us-east-1.data.aws_ami.ubuntu2004: Read complete after 0s [id=ami-079ca844e323047c2]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.ansible_ec2_role: Refreshing state... [id=ec2_ansible_role-dev]
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_deployment_config.ansible: Refreshing state... [id=ansible-deployment-config-dev]
module.us-east-1.data.aws_ami.amazon_linux_2: Read complete after 1s [id=ami-0cabc39acf991f4f1]
module.us-east-1.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01943e9094fef1ed4]
module.us-east-1.data.aws_availability_zones.az_zones: Read complete after 0s [id=us-east-1]
module.us-east-1.data.aws_route53_zone.private_zone: Reading...
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_app.ansible: Refreshing state... [id=7045c0d1-b813-4eb8-90ff-e40e982961f2:ansible-app-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.github_role: Refreshing state... [id=github_ansible_role-dev]
module.us-east-1.module.platform.module.ansible_server.aws_kms_alias.key_alias: Refreshing state... [id=alias/ansible-bucket-key]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy_attachment.AWSCodeDeployRole: Refreshing state... [id=ansible_codedeploy_role-dev-20220903030503371800000002]
module.us-east-1.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-08da61dea2f92b32e]
module.us-east-1.module.platform.data.aws_route53_zone.ktech_public: Read complete after 1s [id=Z05014963P29XRPD1Q5CR]
module.us-east-1.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c6ea0142edbf2adb]
module.us-east-1.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00d302f29ecef47a3]
module.us-east-1.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03907fd1f3a554293]
module.us-east-1.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0fce2aec0346640a4]
module.us-east-1.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b6e50e443bca89cc]
module.us-east-1.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d76334d3aeda4426]
module.us-east-1.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-021dc4543b8d26a1b]
module.us-east-1.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-015c8e249f8ef8822]
module.us-east-1.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0c9ce052b26d1edc4]
module.us-east-1.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09087a65e0fad8bb5]
module.us-east-1.module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-0b077604033277267]
module.us-east-1.module.zones.aws_route53_zone.this["dev.private.ktech-br.com"]: Refreshing state... [id=Z021527012FJ5O69RHJ7X]
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_deployment_group.ansible: Refreshing state... [id=7258635f-1577-455a-9eb6-30936c8195e6]
module.us-east-1.module.platform.aws_security_group.allow_outbound: Refreshing state... [id=sg-09226398b84d2d449]
module.us-east-1.module.platform.aws_security_group.allow_ping: Refreshing state... [id=sg-078346d964b865f0d]
module.us-east-1.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-021dc4543b8d26a1b1080289494]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.ansible_ec2_policy_inventory: Refreshing state... [id=ec2_ansible_role-dev:ec2_ansible_policy_inventory-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_instance_profile.ansible_ec2_profile: Refreshing state... [id=ec2_ansible_profile-dev]
module.us-east-1.module.platform.module.bastion.aws_security_group.bastion_public_ssh: Refreshing state... [id=sg-04990c268ba9b579f]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_http: Refreshing state... [id=sg-036dad764e14ca1c2]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_https: Refreshing state... [id=sg-05c785851f3e353ab]
module.us-east-1.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0219f69b7a3c18ab0]
module.us-east-1.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ab999d99667bdf44]
module.us-east-1.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-02704263fd8375665]
module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-09c61a5862f7c54a2]
module.us-east-1.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e3352fed21b77850]
module.us-east-1.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a402eed4fd1146f7]
module.us-east-1.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0ae86aa55b4dbfebe]
module.us-east-1.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0048828f2c325f735]
module.us-east-1.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-099edd6322af8e44c]
module.us-east-1.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-02f1a774019794c5d]
module.us-east-1.module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0eccdc672e4605372]
module.us-east-1.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=vpc-us-east-1-dev]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket_acl.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev,private]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.github_policy: Refreshing state... [id=github_ansible_role-dev:github_ansible_policy-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.ansible_ec2_policy: Refreshing state... [id=ec2_ansible_role-dev:ec2_ansible_policy-dev]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket_versioning.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.codepipeline_policy: Refreshing state... [id=codepipeline_ansible_role-dev:codepipeline_policy-dev]
module.us-east-1.module.platform.module.ansible_server.aws_codepipeline.codepipeline: Refreshing state... [id=ansible-deploy-pipeline-dev]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.grafana_http_instance: Refreshing state... [id=sg-0419827cb0449cb1e]
module.us-east-1.module.platform.aws_security_group.allow_ansible_admin_subnet_ssh: Refreshing state... [id=sg-02d35640e4b6beee8]
module.us-east-1.data.aws_route53_zone.private_zone: Read complete after 1s [id=Z021527012FJ5O69RHJ7X]
module.us-east-1.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09087a65e0fad8bb51080289494]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:loadbalancer/app/alb-grafana-dashboards-dev/ba7abd8db98cd44e]
module.us-east-1.module.platform.module.bastion.module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-01149a90e766e98ed]
module.us-east-1.module.platform.module.grafana_dashboards.aws_route53_record.grafana_public: Refreshing state... [id=Z05014963P29XRPD1Q5CR_grafana.dev.ktech-devops.com.br_CNAME]
module.us-east-1.module.platform.aws_security_group.allow_bastion_ssh: Refreshing state... [id=sg-09e82a08289c8a075]
module.us-east-1.module.platform.module.bastion.aws_route53_record.bastion_public: Refreshing state... [id=Z05014963P29XRPD1Q5CR_bastion.dev.ktech-devops.com.br_A]
module.us-east-1.module.platform.module.ansible_server.module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-09c498b741d6b8909]
module.us-east-1.module.platform.module.grafana_dashboards.module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-001d6744cb88bde86]
module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-822740743]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:targetgroup/graf-20220903030739068400000005/7bfcd95827f2ce61]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group_attachment.this["0.target"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:targetgroup/graf-20220903030739068400000005/7bfcd95827f2ce61-20220903030739900300000006]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:listener/app/alb-grafana-dashboards-dev/ba7abd8db98cd44e/9e5457fbaf699c80]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.us-east-1.module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-06c299d72b1acf293"
        id                   = "eipalloc-01943e9094fef1ed4"
      + network_interface    = "eni-0a49f28f4eb8e24a8"
      + private_dns          = "ip-10-1-101-130.ec2.internal"
      + private_ip           = "10.1.101.130"
        tags                 = {
            "Name" = "vpc-us-east-1-dev-us-east-1a"
        }
        # (8 unchanged attributes hidden)
    }

  # module.us-east-1.module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-09087a65e0fad8bb5"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0048828f2c325f735"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "vpc-us-east-1-dev-private"
        }
        # (5 unchanged attributes hidden)
    }

  # module.us-east-1.module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-021dc4543b8d26a1b"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-00d302f29ecef47a3"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "vpc-us-east-1-dev-public"
        }
        # (5 unchanged attributes hidden)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_listener.frontend_http_tcp[0] has changed
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:023093918714:listener/app/alb-grafana-dashboards-dev/ba7abd8db98cd44e/9e5457fbaf699c80"
      + tags              = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
        id                     = "sg-09c61a5862f7c54a2"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.2.4/32",
                ]
              + description      = "PostgreSQL access from within VPC"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
        name                   = "grafana_db-dev-20220903030516775500000004"
        tags                   = {
            "Name" = "grafana_db-dev"
        }
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.us-east-1.module.platform.module.ansible_server.aws_route53_record.grafana_private will be created
  + resource "aws_route53_record" "grafana_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ansible.dev.private.ktech-br.com"
      + records         = [
          + "10.1.1.253",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z021527012FJ5O69RHJ7X"
    }

  # module.us-east-1.module.platform.module.bastion.aws_route53_record.grafana_private will be created
  + resource "aws_route53_record" "grafana_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bastion.dev.private.ktech-br.com"
      + records         = [
          + "10.1.101.10",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z021527012FJ5O69RHJ7X"
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_route53_record.grafana_private will be created
  + resource "aws_route53_record" "grafana_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "grafana.dev.private.ktech-br.com"
      + records         = [
          + "10.1.2.4",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z021527012FJ5O69RHJ7X"
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_route53_record.rds_private will be created
  + resource "aws_route53_record" "rds_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "grafana-rds.dev.private.ktech-br.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z021527012FJ5O69RHJ7X"
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "grafana"
      + db_subnet_group_name                  = "vpc-us-east-1-dev"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.1"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = "final-grafana-rds-dev-25fac691"
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "grafana-rds-dev"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + max_allocated_storage                 = 20
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "grafana-rds-dev-20220903030502339000000001"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + timezone                              = (known after apply)
      + username                              = "grafana_usr"
      + vpc_security_group_ids                = [
          + "sg-09c61a5862f7c54a2",
        ]

      + restore_to_point_in_time {
          + use_latest_restorable_time = true
        }

      + timeouts {}
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on main.tf line 23, in module "us-east-1":
  23:     aws = aws.use1

There is no explicit declaration for local provider name "aws" in
module.us-east-1, so Terraform is assuming you mean to pass a configuration
for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @kaio6fellipe, Action: `pull_request`*